# VertexPositionNormal Constructor (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
VertexPositionNormal Constructor
VertexPositionNormal Class See Also
---
Constructs the vertex from a point and a normal vector.
**Namespace:** Autodesk.Revit.DB.DirectContext3D**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public VertexPositionNormal(
	XYZ position,
	XYZ normal
)
```

Visual Basic
---
```text
Public Sub New ( _
	position As XYZ, _
	normal As XYZ _
)
```

Visual C++
---
```text
public:
VertexPositionNormal(
	XYZ^ position,
	XYZ^ normal
)
```

# ### Parameters
position
    Type: Autodesk.Revit.DB..::..XYZ The vertex's position.
normal
    Type: Autodesk.Revit.DB..::..XYZ The vertex's normal vector.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
VertexPositionNormal Class
Autodesk.Revit.DB.DirectContext3D Namespace